# ''' 7. Напишите программу, которая считывает три числа и выводит их сумму и произведение. Каждое число записано в
# отдельной строке.
i1 = int(input('Введите с клавиатуры число1: '))
i2 = int(input('Введите с клавиатуры число2: '))
i3 = int(input('Введите с клавиатуры число3: '))
s = i1+i2+i3
p = i1*i2*i3
print("сумма", s)
print ("произведение", p)