# ''' Напишите программу, которая считывает три числа и выводит их сумму и произведение. Каждое число записано в отдельной строке.
K1 = int(input('Введите с клавиатуры длину катета K1: '))
K2 = int(input('Введите с клавиатуры длину катета K2: '))
print("Площадь треугольника равна S = 1 / 2 * K1 * K2 ")
s = 0.5 * K1 * K2
print(s)