#11. Напишите программу, которая приветствует пользователя, выводя слово `Hello`, введенное имя и знаки препинания
#по образцу: `Hello Kitty!`

i=input("введите ваше имя ")
print(" ’Hello", i, "!’")